Tekla Open API Reference for Tekla Structures 2025
WpfReinforcementCatalog Class
 The WpfReinforcementCatalog class represents a group of controls to select rebars using the reinforcement catalog.
 WpfReinforcementCatalog
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfReinforcementCatalog : UserControl,
	IComponentConnector
Public Class WpfReinforcementCatalog
	Inherits UserControl
	Implements IComponentConnector
The WpfReinforcementCatalog type exposes the following members.
Constructors
Name | Description
WpfReinforcementCatalog()
 Initiates a new instance of the control.
WpfReinforcementCatalog(String, String, Double)
 Creates a new instance of the ReinforcementCatalog and will select in the tree the rebar that contains the given parameters (if possible).
Top
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedRebarBendingRadius
 Gets the selected rebar bending radius in the control.
SelectedRebarGrade
 Gets the selected rebar grade in the control.
SelectedRebarSize
 Gets the selected rebar size in the control.
SelectedUsage
 Gets the selected rebar usage in the control.
Top
Methods
Name | Description
InitializeComponent
 InitializeComponent
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace